mediaMicroservices/wrk2/outs/c200_r10.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 200 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.32s     6.68s   41.09s    88.85%
    Req/Sec     1.59     12.88   100.00     98.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.00s 
 75.000%   10.01s 
 90.000%   20.51s 
 99.000%   41.09s 
 99.900%    0.92m 
 99.990%    0.92m 
 99.999%    0.92m 
100.000%    0.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          166         1.00
   10002.431     0.100000          166         1.11
   10002.431     0.200000          166         1.25
   10002.431     0.300000          166         1.43
   10002.431     0.400000          166         1.67
   10002.431     0.500000          166         2.00
   10010.623     0.550000          268         2.22
   10010.623     0.600000          268         2.50
   10010.623     0.650000          268         2.86
   10010.623     0.700000          268         3.33
   10010.623     0.750000          268         4.00
   10010.623     0.775000          268         4.44
   10010.623     0.800000          268         5.00
   10010.623     0.825000          268         5.71
   10010.623     0.850000          268         6.67
   16711.679     0.875000          275         8.00
   18268.159     0.887500          279         8.89
   20512.767     0.900000          283        10.00
   22265.855     0.912500          287        11.43
   23101.439     0.925000          291        13.33
   25739.263     0.937500          295        16.00
   26607.615     0.943750          297        17.78
   27721.727     0.950000          300        20.00
   27983.871     0.956250          301        22.86
   28868.607     0.962500          303        26.67
   32260.095     0.968750          305        32.00
   32784.383     0.971875          306        35.56
   35520.511     0.975000          307        40.00
   37257.215     0.978125          308        45.71
   37355.519     0.981250          309        53.33
   39714.815     0.984375          310        64.00
   39714.815     0.985938          310        71.11
   41091.071     0.987500          311        80.00
   41091.071     0.989062          311        91.43
   42237.951     0.990625          312       106.67
   42237.951     0.992188          312       128.00
   42237.951     0.992969          312       142.22
   52264.959     0.993750          313       160.00
   52264.959     0.994531          313       182.86
   52264.959     0.995313          313       213.33
   52264.959     0.996094          313       256.00
   52264.959     0.996484          313       284.44
   55214.079     0.996875          314       320.00
   55214.079     1.000000          314          inf
#[Mean    =    12316.542, StdDeviation   =     6680.737]
#[Max     =    55181.312, Total count    =          314]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  316 requests in 1.00m, 110.17KB read
  Socket errors: connect 0, read 0, write 0, timeout 5502
  Non-2xx or 3xx responses: 316
Requests/sec:      5.26
Transfer/sec:      1.83KB