mediaMicroservices/wrk2/outs/c200_r100.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 200 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10006.528ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    27.83s    13.27s    0.87m    56.33%
    Req/Sec     4.72     22.28   111.00     95.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.97s 
 75.000%   39.12s 
 90.000%   46.63s 
 99.000%    0.87m 
 99.900%    0.90m 
 99.990%    0.92m 
 99.999%    0.92m 
100.000%    0.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          149         1.00
   10002.431     0.100000          149         1.11
   10010.623     0.200000          201         1.25
   19677.183     0.300000          270         1.43
   21807.103     0.400000          360         1.67
   27967.487     0.500000          450         2.00
   29933.567     0.550000          495         2.22
   31506.431     0.600000          540         2.50
   34471.935     0.650000          585         2.86
   37158.911     0.700000          630         3.33
   39124.991     0.750000          675         4.00
   40599.551     0.775000          698         4.44
   41680.895     0.800000          720         5.00
   42500.095     0.825000          743         5.71
   43548.671     0.850000          765         6.67
   44924.927     0.875000          788         8.00
   45645.823     0.887500          799         8.89
   46628.863     0.900000          812        10.00
   47251.455     0.912500          822        11.43
   47710.207     0.925000          835        13.33
   48660.479     0.937500          844        16.00
   48857.087     0.943750          851        17.78
   49020.927     0.950000          856        20.00
   49381.375     0.956250          862        22.86
   49807.359     0.962500          867        26.67
   50429.951     0.968750          872        32.00
   50626.559     0.971875          875        35.56
   50888.703     0.975000          878        40.00
   51314.687     0.978125          881        45.71
   51675.135     0.981250          884        53.33
   51904.511     0.984375          886        64.00
   51970.047     0.985938          888        71.11
   52133.887     0.987500          889        80.00
   52297.727     0.989062          891        91.43
   52527.103     0.990625          892       106.67
   52985.855     0.992188          893       128.00
   53247.999     0.992969          894       142.22
   53379.071     0.993750          895       160.00
   53641.215     0.994531          896       182.86
   53641.215     0.995313          896       213.33
   53673.983     0.996094          897       256.00
   53673.983     0.996484          897       284.44
   53903.359     0.996875          898       320.00
   53903.359     0.997266          898       365.71
   53903.359     0.997656          898       426.67
   54067.199     0.998047          899       512.00
   54067.199     0.998242          899       568.89
   54067.199     0.998437          899       640.00
   54067.199     0.998633          899       731.43
   54067.199     0.998828          899       853.33
   55017.471     0.999023          900      1024.00
   55017.471     1.000000          900          inf
#[Mean    =    27834.109, StdDeviation   =    13272.789]
#[Max     =    54984.704, Total count    =          900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  904 requests in 1.00m, 315.16KB read
  Socket errors: connect 0, read 0, write 0, timeout 2218
  Non-2xx or 3xx responses: 904
Requests/sec:     15.05
Transfer/sec:      5.25KB