mediaMicroservices/wrk2/outs/c200_r250.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 200 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.13s    14.21s    0.89m    60.18%
    Req/Sec     5.26     24.63   111.00     95.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.24s 
 75.000%   41.45s 
 90.000%   50.10s 
 99.000%    0.89m 
 99.900%    0.92m 
 99.990%    0.92m 
 99.999%    0.92m 
100.000%    0.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          151         1.00
   10002.431     0.100000          151         1.11
   16670.719     0.200000          200         1.25
   20054.015     0.300000          300         1.43
   25411.583     0.400000          399         1.67
   30244.863     0.500000          499         2.00
   31211.519     0.550000          550         2.22
   35225.599     0.600000          600         2.50
   38961.151     0.650000          650         2.86
   40173.567     0.700000          698         3.33
   41451.519     0.750000          748         4.00
   42303.487     0.775000          773         4.44
   44564.479     0.800000          798         5.00
   47480.831     0.825000          823         5.71
   48463.871     0.850000          848         6.67
   49446.911     0.875000          873         8.00
   49840.127     0.887500          888         8.89
   50135.039     0.900000          900        10.00
   50528.255     0.912500          911        11.43
   50823.167     0.925000          926        13.33
   51118.079     0.937500          936        16.00
   51216.383     0.943750          942        17.78
   51347.455     0.950000          949        20.00
   51511.295     0.956250          954        22.86
   51642.367     0.962500          960        26.67
   51806.207     0.968750          966        32.00
   51937.279     0.971875          969        35.56
   52396.031     0.975000          973        40.00
   52494.335     0.978125          976        45.71
   52789.247     0.981250          979        53.33
   52985.855     0.984375          983        64.00
   52985.855     0.985938          983        71.11
   53247.999     0.987500          985        80.00
   53542.911     0.989062          987        91.43
   53641.215     0.990625          988       106.67
   54099.967     0.992188          990       128.00
   54099.967     0.992969          990       142.22
   54198.271     0.993750          991       160.00
   54231.039     0.994531          992       182.86
   54657.023     0.995313          993       213.33
   54853.631     0.996094          994       256.00
   54853.631     0.996484          994       284.44
   54853.631     0.996875          994       320.00
   55050.239     0.997266          995       365.71
   55050.239     0.997656          995       426.67
   55345.151     0.998047          996       512.00
   55345.151     0.998242          996       568.89
   55345.151     0.998437          996       640.00
   55345.151     0.998633          996       731.43
   55345.151     0.998828          996       853.33
   55443.455     0.999023          997      1024.00
   55443.455     1.000000          997          inf
#[Mean    =    30131.548, StdDeviation   =    14212.939]
#[Max     =    55410.688, Total count    =          997]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1000 requests in 1.00m, 348.63KB read
  Socket errors: connect 0, read 0, write 0, timeout 489
  Non-2xx or 3xx responses: 1000
Requests/sec:     16.65
Transfer/sec:      5.80KB